{"config": {"name": "model_2", "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"name": "input_3", "config": {"name": "input_3", "batch_input_shape": [null, 34], "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "input_2", "config": {"name": "input_2", "batch_input_shape": [null, 2048], "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"name": "embedding_1", "input_length": null, "dtype": "float32", "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, null], "output_dim": 200, "mask_zero": true, "embeddings_constraint": null, "trainable": false, "activity_regularizer": null, "embeddings_regularizer": null, "input_dim": 1652}, "class_name": "Embedding", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "dense_1", "config": {"name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "lstm_1", "config": {"kernel_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "trainable": true, "activity_regularizer": null, "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "lstm_1", "kernel_constraint": null, "unit_forget_bias": true, "return_state": false, "bias_regularizer": null, "return_sequences": false, "use_bias": true, "activation": "tanh", "implementation": 1, "units": 256, "recurrent_dropout": 0.0, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null}, "class_name": "LSTM", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["dense_1", 0, 0, {}], ["lstm_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"name": "dense_2", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "dense_3", "config": {"name": "dense_3", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "softmax", "units": 1652, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "output_layers": [["dense_3", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.5", "backend": "tensorflow"}